app/Controllers/Expense.php

    public function index()
    {
        ## Fetch all records from database
       $data['expense_show'] = $this->expenseaddobject->findAll();
       $data['expense_sub_category_show'] = $this->expense_sub_category_model_object->findAll();
       $data['expense_category_show'] = $this->expense_category_model_object->findAll();
---
SELECT *
FROM `expense`
SELECT *
FROM `expense_sub_category`
SELECT *
FROM `expense_category`