app/Controllers/ExpenseSubCategoryController.php

SELECT *
FROM `expense_sub_category`
SELECT *
FROM `expense_category`
---
   public function index()
   {
      $data['expense_sub_category_show'] = $this->expense_sub_category_model_object->findAll();
      $data['expense_category_show'] = $this->expense_category_model_object->findAll();

DELETE FROM `expense_sub_category`
WHERE `expense_sub_category_id` = '25'
---
   public function delete($id = 0)
   {

      $id = $this->request->getVar('delete_id');

      $this->expense_sub_category_model_object->where('expense_sub_category_id', $id)->delete();