app/Controllers/ExpenseCategoryController.php

SELECT *
FROM `expense_category`
---
   public function index()
   {
      $data['expense_category_show'] = $this->expense_category_model_object->findAll();