app/Controllers/ExpenseController.php

    public function index()
    {
        $data = [
            'expense_category_show' => $this->expense_category_model_object->findAll(),
            'expense_sub_category_show' => $this->expense_sub_category_model_object->findAll(),
            'expense_category_sub_category_show' => $this->expenseaddobject->getExpenseList(),
        ];
---
SELECT *
FROM `expense_category`
SELECT *
FROM `expense_sub_category`