app/Controllers/Group.php

DELETE FROM `product_group`
WHERE `product_group_id` = '32'
---
   public function delete($id = 0)
   {

      $id = $this->request->getVar('delete_id');

      $this->productgroup_object->where('product_group_id', $id)->delete();