app/Controllers/Login.php

    public function auth()
    {
        $login_id = $this->request->getPost('username');
        $login_pw = $this->request->getPost('password');

        $builder = $this->db->table('user');
        $builder->where('login_id', $login_id);
        $query  = $builder->get();
---
SELECT *
FROM `user`
WHERE `login_id` = 'kabir'

    private function getUserPrivileges()
    {
        $role_id = $this->session->get('user_role_id');
        if (! $role_id) {
            return [];
        }

        $role = $this->db->table('user_role')
            ->where('user_role_id', $role_id)
            ->get()
            ->getRow();

        if (! $role) {
            return [];
        }

        $menu_ids = explode(',', $role->user_previlege);
        $menus    = $this->db->table('menu_id')
            ->whereIn('menu_id', $menu_ids)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `user_role`
WHERE `user_role_id` = '46'
SELECT *
FROM `menu_id`
WHERE `menu_id` IN ('1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24','25','26','0','28','29','30','31','32')