app/Controllers/LoginController.php

SELECT `user_id`, `login_id`, `login_password`, `user_role_id`, `user_name`
FROM `user`
WHERE `login_id` = 'kabir'
 LIMIT 1
---
    public function auth()
    {

        $login_id = trim((string) $this->request->getPost('username'));
        $login_pw = (string) $this->request->getPost('password');

        if ($login_id === '' || $login_pw === '') {
            return $this->response->setJSON([
                'status' => 'error',
                'msg' => 'Username and password are required.',
            ]);
        }

        $result = $this->db
            ->table('user')
            ->select('user_id, login_id, login_password, user_role_id, user_name')
            ->where('login_id', $login_id)
            ->limit(1)
            ->get()
            ->getRow();

SELECT `user_previlege`
FROM `user_role`
WHERE `user_role_id` = '46'
SELECT `menu_name`
FROM `menu_id`
WHERE `menu_id` IN ('1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24','25','26','27','28','29','30','31','32')
---
    private function getUserPrivileges()
    {
        $role_id = $this->session->get('user_role_id');

        if (!$role_id) {
            return [];
        }

        $role = $this->db->table('user_role')
            ->select('user_previlege')
            ->where('user_role_id', $role_id)
            ->get()
            ->getRow();

        if (!$role || empty($role->user_previlege)) {
            return [];
        }

        $menu_ids = array_filter(array_map('trim', explode(',', $role->user_previlege)));

        if ($menu_ids === []) {
            return [];
        }

        $menus = $this->db->table('menu_id')
            ->select('menu_name')
            ->whereIn('menu_id', $menu_ids)
            ->get()
            ->getResultArray();