app/Controllers/pos.php

SELECT *
FROM `product_category`
SELECT *
FROM `product_brand`
SELECT *
FROM `customer`
---
    public function index()
    {
        $data['product_show_for_sale'] = $this->products(); //products function called
        $data['product_category_show'] = $this->productCategory_object->findAll();
        $data['product_brand_show'] = $this->ProductBrand_object->findAll();
        $data['customer_show'] = $this->customerModel_object->findAll();