app/Controllers/Product.php

SELECT *
FROM `product_category`
SELECT *
FROM `product_brand`
SELECT *
FROM `product_group`
SELECT *
FROM `product_unit`
---
   public function index()
   {
      $data['category_show'] = $this->productCategory_object->findAll();
      $data['brand_show']    = $this->ProductBrandModel->findAll();
      $data['group_show']    = $this->productgroup_object->findAll();
      $data['unit_show']     = $this->productunit_object->findAll();

SELECT *
FROM `product_brand`
WHERE `product_category_id` = '105'
---
   public function brand_call()
   {
      $categoryId = $_POST['categoryId'];
      $builder = $this->db->table('product_brand');
      $builder->where('product_category_id', $categoryId);
      $query   = $builder->get();