app/Controllers/Product.php

SELECT *
FROM `product_brand`
WHERE `product_category_id` = '132'
---
    public function brand_call()
    {
        $categoryId = $_POST['categoryId'];
        $builder = $this->db->table('product_brand');
        $builder->where('product_category_id', $categoryId);
        $query = $builder->get();