app/Controllers/ProductController.php

SELECT *
FROM `product_category`
SELECT *
FROM `product_brand`
SELECT *
FROM `product_group`
SELECT *
FROM `product_unit`
SELECT *
FROM `product_strength`
---
    public function index()
    {
        $data = [
            'category_show' => $this->productCategory_object->findAll(),
            'brand_show' => $this->ProductBrandModel->findAll(),
            'group_show' => $this->productgroup_object->findAll(),
            'unit_show' => $this->productunit_object->findAll(),
            'strength_show' => $this->ProductStrengthModel_object->findAll(),
            'tax_show' => $this->tax_object->findAll(),
            'product_show' => $this->productModelObject->getProductList(),
        ];