app/Controllers/Purchase.php

SELECT *
FROM `supplier`
---
    public function index()
    {

        $sql = "SELECT piq.*,
                tx.tax_percentage,
                tx.tax_name,
                productinitial_quantity + IFNULL(ppd.new_purchased,0) AS total_stock
        FROM product_inital_stock as piq
        LEFT JOIN (
            SELECT product_id,SUM(quantity_per_pack) as new_purchased
            FROM product_purchase_details
            GROUP BY product_id
            ) as ppd
           ON piq.product_id = ppd.product_id

           LEFT JOIN tax as tx  ON piq.tax_id = tx.tax_id ";

        $data['product_show_for_sale'] = $this->db->query($sql)->getResult('array');

        $data['supplier_show'] = $this->supplier_object->findAll();

SELECT `tax_percentage`
FROM `tax`
WHERE `tax_id` = '8'
---
        // Update tax table if needed
        $tax_id = $row['tax_id'] ?? null;
        if ($tax_id) {
            $current_tax = $this->db->table('tax')
                ->select('tax_percentage')
                ->where('tax_id', $tax_id)
                ->get()->getRowArray()['tax_percentage'] ?? 0;

INSERT INTO `product_purchase_details` (`base_price_per_unit`, `box_quantity`, `product_id`, `product_wise_discount_amount`, `product_wise_vat_amount`, `purchase_invoice_id`, `quantity_per_pack`)
VALUES (95.24,1,'1',0,'4.76','PUR2608255348',1)
---
    }

    // Insert purchase details batch
    $this->product_purchase_details_object->insertBatch($purchase_details_invoice_data);

INSERT INTO `product_purchase` (`purchase_invoice`, `purchaser_id`, `payment_type`, `supplier_id`, `total_price`, `discount_on_total_price`, `vat_on_total`, `net_total`, `purchase_date`) VALUES ('PUR2608255348', '18', 'Cash', '124', 100, 0, 0, 100, '2026-03-23 15:45:57')
---
        "net_total" => $net_total, // Will update later
        "purchase_date" => date("Y-m-d H:i:s"),
    ];
    $this->product_purchase_object->insert($purchase_data);