app/Controllers/PurchaseController.php

SELECT *
FROM `supplier`
SELECT *
FROM `product_category`
SELECT *
FROM `product_group`
SELECT *
FROM `product_strength`
SELECT *
FROM `product_unit`
---
    public function index()
    {
   $data = [
            'getDefaultOpeningStock' => $this->product_add_object->getProductsWithCurrentStock(),

            'supplier_show'         => $this->supplier_object->findAll(),
//============For Opening Stock=========================
            'category_show'         => $this->productCategory_object->findAll(),
            'group_show'            => $this->productgroup_object->findAll(),
            'strength_show'         => $this->ProductStrengthModel_object->findAll(),
            'unit_show'             => $this->productunit_object->findAll(),