app/Controllers/Role.php

   public function index()
   {
      // Fetch roles
      $roles = $this->db->table('user_role')->get()->getResultArray();
      // Fetch menus ordered by menu_id
      $menus = $this->db->table('menu_id')->orderBy('menu_id')->get()->getResultArray();
---
SELECT *
FROM `user_role`
SELECT *
FROM `menu_id`
ORDER BY `menu_id`