app/Models/ExpenseAddModel.php

    public function getExpenseList()
    {
        return $this->db->table('expense ex')
            ->select('
                ex.*,
                exc.expense_category_name,
                exsc.expense_sub_category_name
            ')
            ->join(
                'expense_category exc',
                'exc.expense_category_id = ex.expense_category',
                'left'
            )
            ->join(
                'expense_sub_category exsc',
                'exsc.expense_sub_category_id = ex.expense_sub_category',
                'left'
            )
            ->orderBy('ex.expense_id', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `ex`.*, `exc`.`expense_category_name`, `exsc`.`expense_sub_category_name`
FROM `expense` `ex`
LEFT JOIN `expense_category` `exc` ON `exc`.`expense_category_id` = `ex`.`expense_category`
LEFT JOIN `expense_sub_category` `exsc` ON `exsc`.`expense_sub_category_id` = `ex`.`expense_sub_category`
ORDER BY `ex`.`expense_id` DESC