app/Models/NewProductAddModel.php

SELECT `pr`.*, `pc`.`category_name`, `pg`.`group_name`, `pb`.`product_brand_name`, `pu`.`product_unit_name`, `ps`.`strength_name`, `tx`.`tax_name`, `tx`.`tax_percentage`
FROM `product_inital_stock` AS `pr`
LEFT JOIN `product_category` AS `pc` ON `pr`.`product_category` = `pc`.`product_category_id`
LEFT JOIN `product_group` AS `pg` ON `pr`.`product_group` = `pg`.`product_group_id`
LEFT JOIN `product_brand` AS `pb` ON `pr`.`product_brand` = `pb`.`brand_id`
LEFT JOIN `product_unit` AS `pu` ON `pr`.`product_unit` = `pu`.`product_unit_id`
LEFT JOIN `product_strength` AS `ps` ON `pr`.`product_strength` = `ps`.`strength_id`
LEFT JOIN `tax` AS `tx` ON `pr`.`tax_id` = `tx`.`tax_id`
ORDER BY `pr`.`product_id` DESC
---
    public function getProductList()
{
    return $this->db->table('product_inital_stock AS pr')
        ->select('
            pr.*,
            pc.category_name,
            pg.group_name,
            pb.product_brand_name,
            pu.product_unit_name,
            ps.strength_name,
            tx.tax_name,
            tx.tax_percentage
        ')
        ->join('product_category AS pc', 'pr.product_category = pc.product_category_id', 'left')
        ->join('product_group AS pg', 'pr.product_group = pg.product_group_id', 'left')
        ->join('product_brand AS pb', 'pr.product_brand = pb.brand_id', 'left')
        ->join('product_unit AS pu', 'pr.product_unit = pu.product_unit_id', 'left')
        ->join('product_strength AS ps', 'pr.product_strength = ps.strength_id', 'left')
        ->join('tax AS tx', 'pr.tax_id = tx.tax_id', 'left')
        ->orderBy('pr.product_id', 'DESC')
        ->get()
        ->getResultArray();