app/Models/ProductPurchaseModel.php

SELECT `tax_percentage`
FROM `tax`
WHERE `tax_id` = '14'
---

            if (!empty($row['tax_id'])) {

                $current_tax = $db->table('tax')
                    ->select('tax_percentage')
                    ->where('tax_id', $row['tax_id'])
                    ->get()
                    ->getRowArray();

INSERT INTO `product_purchase_details` (`base_price_per_unit`, `box_quantity`, `free_qty`, `product_id`, `product_wise_discount_amount`, `product_wise_vat_amount`, `purchase_invoice_id`, `purchase_price`, `quantity_per_pack`)
VALUES (30,1,0,'576',0,0.6,'PUR26200B189C',30.6,1), (1,1,0,'573',0,0.02,'PUR26200B189C',1.02,1)
---
        }

        $detailModel = new ProductPurchaseDetailsModel();
        $detailModel->insertBatch($purchase_details);

INSERT INTO `product_purchase` (`purchase_invoice`, `purchaser_id`, `payment_type`, `supplier_id`, `invoice_total`, `discount_amount_on_invoice_total`, `vat_amount_on_invoice_total`, `invoice_net_total`, `purchase_date`) VALUES ('PUR26200B189C', '18', 'Cash', '106', 31.62, 0, 0.196044, 31.816044, '2026-07-19 19:03:53')
---

        $vat_amount_on_total_price = $total_purchase_amount * ($vat_amt_on_total / 100);

        $this->insert([
            'purchase_invoice'                  => $invoice_id,
            'purchaser_id'                      => $purchaser_id,
            'payment_type'                      => 'Cash',
            'supplier_id'                       => $supplier_id,
            'invoice_total'                     => $total_purchase_amount,
            'discount_amount_on_invoice_total'  => $discount_on_total_price,
            'vat_amount_on_invoice_total'       => $vat_amount_on_total_price,
            'invoice_net_total'                 => $net_total,
            'purchase_date'                     => date('Y-m-d H:i:s')
        ]);